# Pandas : Panel Data

In [2]:
# It Is a very popular library which is used for Manipulation and Analysis of data
# There are lot of predefined functionswhich will reduce your time typing
# Panel Data is multi-diensional data involving measurements over the time

### Benefits:
    * Accesible to everyone
    * Flexible
    * Powerful
    * Easy to use
    * Fast

### DataStructures in Pandas
    * Series - 1D
    * DataFrame -2D

In [3]:
import pandas as pd

In [6]:
ser1=pd.Series({"Ali":100,"Bali":100,"Cali":100,"Dali":100})  # it's follow the linked list

In [13]:
print(ser1)
type(ser1)

Ali     100
Bali    100
Cali    100
Dali    100
dtype: int64

pandas.core.series.Series

In [8]:
ser1.ndim

1

In [9]:
ser1["Ali"]

100

In [11]:
ser1["Ali":]

Ali     100
Bali    100
Cali    100
Dali    100
dtype: int64

In [12]:
ser1[:"Dali"]

Ali     100
Bali    100
Cali    100
Dali    100
dtype: int64

In [14]:
ser1.values    # It returns the numpy array with all the values

array([100, 100, 100, 100], dtype=int64)

In [15]:
ser1.index

Index(['Ali', 'Bali', 'Cali', 'Dali'], dtype='object')

In [17]:
# Two defferebt arrays binded with key values pair

In [20]:
ser1[1:3]  # also extract the value from index value

Bali    100
Cali    100
dtype: int64

In [21]:
# It allows the duplicate index but it will consider the last occurance, example given below

In [28]:
# Creating Pandas series with DICTIONARY
ser1=pd.Series({"Ali":100,"Bali":100,"Cali":100,"Dali":100,"Ali":2000})  # Ali has overriden with new value

In [29]:

ser1

Ali     2000
Bali     100
Cali     100
Dali     100
dtype: int64

In [35]:
# Creating Pandas series with two list
ser2=pd.Series(data=[10,20,30,40,50,60,70],index=["A","B","C","D","E","F","A"])

In [36]:
ser2

A    10
B    20
C    30
D    40
E    50
F    60
A    70
dtype: int64

In [37]:
# Slicing will fail when we have duplicate indexes

In [41]:
ser2["A":]  # KeyError: "Cannot get left slice bound for non-unique label: 'A'"

KeyError: "Cannot get left slice bound for non-unique label: 'A'"

In [42]:
ser2+10

A    20
B    30
C    40
D    50
E    60
F    70
A    80
dtype: int64

In [44]:
ser2.index=="A"

array([ True, False, False, False, False, False,  True])

### 2-D data

In [45]:
# Dataframe: Data structure exctly like excel sheet i.e. row and column

In [60]:
df1=pd.DataFrame(data=[[1,200,"JAN","A"],
            [1,200,"FEB","B"],
            [1,200,"JAN","A"],
            [1,200,"FEB","B"],
            [1,200,"JAN","A"]],columns=["Store_ID","Sales","Month","Location"])

In [61]:
df1

   Store_ID  Sales Month Location
0         1    200   JAN        A
1         1    200   FEB        B
2         1    200   JAN        A
3         1    200   FEB        B
4         1    200   JAN        A

In [62]:
df2=pd.DataFrame(data=[[200,"JAN","A"],
            [200,"FEB","B"],
            [200,"JAN","A"],
            [200,"FEB","B"],
            [200,"JAN","A"]],columns=["Sales","Month","Location"],index=[1,2,3,4,5])

In [63]:
df2    #Index is user defined

   Sales Month Location
1    200   JAN        A
2    200   FEB        B
3    200   JAN        A
4    200   FEB        B
5    200   JAN        A

In [69]:
#df1.set_index(["Store_ID"])  #explicitly we can set index
df1.set_index(["Store_ID"],inplace=True)  #explicitly we can set index

In [70]:
df1

          Sales Month Location
Store_ID
1           200   JAN        A
1           200   FEB        B
1           200   JAN        A
1           200   FEB        B
1           200   JAN        A

In [71]:
df1.reset_index(inplace=True)

In [72]:
df1

   Store_ID  Sales Month Location
0         1    200   JAN        A
1         1    200   FEB        B
2         1    200   JAN        A
3         1    200   FEB        B
4         1    200   JAN        A

### Read data from different formats
    1. Excel
    2. Delimited Files(CSV,TSV)
    3. JSON
    4. XML
    5. Prquet
    6. Database Connection(ODBC/JDBC)
    7. Others

In [107]:
pokemanDf=pd.read_csv(r"C:\Users\abc\Documents\Pandas_W\pokemon_data.csv") # specify the correct path according to your directory

In [74]:
sampleData=pd.read_excel(r"E:\ML_AI\PythonCodes\dataset\testXL.xlsx",sheet_name=0)

In [75]:
sampleData

   StoreName  Sales Month City
0          1    120   JAN    A
1          1    100   JAN    A
2          2    120   FEB    B
3          2    150   FEB    B

In [77]:
sampleData.set_index("StoreName",inplace=True)

In [78]:
sampleData

           Sales Month City
StoreName
1            120   JAN    A
1            100   JAN    A
2            120   FEB    B
2            150   FEB    B

### Slicing and Indexing

In [80]:
df3=pd.DataFrame({"Name":["Shash","Shashidhar","Hiremath","Shashii"],
                  "Age":[20,25,30,35],
                  "Occupation":["Pilot","Doctor","Engineer","Collector"]})

In [81]:
df3

         Name  Age Occupation
0       Shash   20      Pilot
1  Shashidhar   25     Doctor
2    Hiremath   30   Engineer
3     Shashii   35  Collector

### Two approaches 
    * loc   : index based filtering
    * iloc  : integer index based filtering

In [83]:
df3.set_index("Name",inplace=True)

In [84]:
df3

            Age Occupation
Name
Shash        20      Pilot
Shashidhar   25     Doctor
Hiremath     30   Engineer
Shashii      35  Collector

In [85]:
df3.loc["Shashii"]

Age                  35
Occupation    Collector
Name: Shashii, dtype: object

In [87]:
df3.loc["Shash":"Shashii"]

            Age Occupation
Name
Shash        20      Pilot
Shashidhar   25     Doctor
Hiremath     30   Engineer
Shashii      35  Collector

In [89]:
df3.loc[["Shash","Shashii"],"Occupation"]

Name
Shash          Pilot
Shashii    Collector
Name: Occupation, dtype: object

In [91]:
# Selecting a column
print(df3.loc[:,"Occupation"])
print(df3["Occupation"])
print([df3.Occupation])

Name
Shash             Pilot
Shashidhar       Doctor
Hiremath       Engineer
Shashii       Collector
Name: Occupation, dtype: object
Name
Shash             Pilot
Shashidhar       Doctor
Hiremath       Engineer
Shashii       Collector
Name: Occupation, dtype: object
[Name
Shash             Pilot
Shashidhar       Doctor
Hiremath       Engineer
Shashii       Collector
Name: Occupation, dtype: object]

In [93]:
df3.reset_index(inplace=True)

In [94]:
df3

         Name  Age Occupation
0       Shash   20      Pilot
1  Shashidhar   25     Doctor
2    Hiremath   30   Engineer
3     Shashii   35  Collector

In [95]:
df3.iloc[0]

Name          Shash
Age              20
Occupation    Pilot
Name: 0, dtype: object

In [97]:
df3.iloc[:1]

    Name  Age Occupation
0  Shash   20      Pilot

### Dataframe methods/properties

In [98]:
df3.shape

(4, 3)

In [99]:
df3.ndim

2

In [102]:
df3.dtypes

Name          object
Age            int64
Occupation    object
dtype: object

In [103]:
df3.head

<bound method NDFrame.head of          Name  Age Occupation
0       Shash   20      Pilot
1  Shashidhar   25     Doctor
2    Hiremath   30   Engineer
3     Shashii   35  Collector>

In [104]:
df3.head(2)

         Name  Age Occupation
0       Shash   20      Pilot
1  Shashidhar   25     Doctor

In [105]:
df3.tail

<bound method NDFrame.tail of          Name  Age Occupation
0       Shash   20      Pilot
1  Shashidhar   25     Doctor
2    Hiremath   30   Engineer
3     Shashii   35  Collector>

In [106]:
df3.tail(2)

       Name  Age Occupation
2  Hiremath   30   Engineer
3   Shashii   35  Collector

In [108]:
pokemanDf

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,80,110,120,130,90,70,6,True

In [113]:
pokemanDf_small=pokemanDf.loc[:,["Name","HP","Defense","Speed"]]

In [114]:
pokemanDf_small.dtypes

Name       object
HP          int64
Defense     int64
Speed       int64
dtype: object

In [116]:
pokemanDf_small.shape

(800, 4)

In [115]:
pokemanDf_small.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 4 columns):
Name       800 non-null object
HP         800 non-null int64
Defense    800 non-null int64
Speed      800 non-null int64
dtypes: int64(3), object(1)
memory usage: 25.1+ KB

In [121]:
pokemanDf_small.isna().sum()

Name       0
HP         0
Defense    0
Speed      0
dtype: int64

### Handling Missing Value
    * remove all rows with missing values
    * remove all columns with missing values
    * fill missing values with some destimation 
# These are not mandotaory steps according to the data we will perform the actions

In [124]:
pokemanDf_small.dropna(axis=0,how='any') #inplace=false  as df has no na values this operation didn't affect anything

                      Name  HP  Defense  Speed
0                Bulbasaur  45       49     45
1                  Ivysaur  60       63     60
2                 Venusaur  80       83     80
3    VenusaurMega Venusaur  80      123     80
4               Charmander  39       43     65
..                     ...  ..      ...    ...
795                Diancie  50      150     50
796    DiancieMega Diancie  50      110    110
797    HoopaHoopa Confined  80       60     70
798     HoopaHoopa Unbound  80       60     80
799              Volcanion  80      120     70

[800 rows x 4 columns]

In [126]:
pokemanDf_small.dropna(axis=1,how='any',thresh=750) #setting threshold

                      Name  HP  Defense  Speed
0                Bulbasaur  45       49     45
1                  Ivysaur  60       63     60
2                 Venusaur  80       83     80
3    VenusaurMega Venusaur  80      123     80
4               Charmander  39       43     65
..                     ...  ..      ...    ...
795                Diancie  50      150     50
796    DiancieMega Diancie  50      110    110
797    HoopaHoopa Confined  80       60     70
798     HoopaHoopa Unbound  80       60     80
799              Volcanion  80      120     70

[800 rows x 4 columns]

In [128]:
pokemanDf_small.dropna(axis=0,how='any',subset=['Name']) #dropping row when Name column having na

                      Name  HP  Defense  Speed
0                Bulbasaur  45       49     45
1                  Ivysaur  60       63     60
2                 Venusaur  80       83     80
3    VenusaurMega Venusaur  80      123     80
4               Charmander  39       43     65
..                     ...  ..      ...    ...
795                Diancie  50      150     50
796    DiancieMega Diancie  50      110    110
797    HoopaHoopa Confined  80       60     70
798     HoopaHoopa Unbound  80       60     80
799              Volcanion  80      120     70

[800 rows x 4 columns]

### Filling values

In [129]:
pokemanDf_small['Defense'].fillna(method='ffill') # forward fill, fill with prv value

0       49
1       63
2       83
3      123
4       43
      ...
795    150
796    110
797     60
798     60
799    120
Name: Defense, Length: 800, dtype: int64

In [130]:
pokemanDf_small['Defense'].fillna(method='bfill') # forward fill, fill with next value

0       49
1       63
2       83
3      123
4       43
      ...
795    150
796    110
797     60
798     60
799    120
Name: Defense, Length: 800, dtype: int64

In [132]:
pokemanDf_small['Defense'].fillna(value=10) # forward fill, fill with particular value i.e. with mean n all

0       49
1       63
2       83
3      123
4       43
      ...
795    150
796    110
797     60
798     60
799    120
Name: Defense, Length: 800, dtype: int64